lists = ["სალათა", "პური", "ხაჭო", 3.5, 5, 6, "კიტრი", "ბადრიჯანი", "პომიდორი", "ლობიო"]



list = [17, 2, 3, 4, 10, 6, 100, 8, 9, 11]
list[0] = 1
list[4] = 5
list[6] = 7
list[9] = 10
print(list)



list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list[3:8])



list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list[7:10])


#lists ითარგმნება როგორც სია. ის პროგრამირებაში გვადგება ძალიან კარგ რამეში მაგალითად როცა 10 რამის დაპრინტვა გინდა გიწევს რომ ჩამოწერო სათითაოდ მაგრამ სია გეხმარება რომ მცოლოდ ერთ ხაზში ჩაწერო ეს ყველაფერი
