#მიმატება
print(2 + 3)  # 5
print(-5 + 10)  # 5
print(0 + 0)  # 0
print(1000 + 3000)  # 4000
print(2.5 + 3.5)  # 6.0

#გამოკლება
print(10 - 5)  # 5
print(-7 - 3)  # -10
print(1000 - 400)  # 600
print(0 - 10)  # -10
print(2.5 - 1.5)  # 1.0

#გამრავლება
print(2 * 3)  # 6
print(-4 * 5)  # -20
print(5 * 0)  # 0
print(1000 * 2)  # 2000
print(2.5 * 4)  # 10.0

#გაყოფა
print(10 / 2)  # 5.0
print(12 / 4)  # 3.0
print(50 / 5)  # 10.0
print(3 / 2)  # 1.5
print(5 / 2)  # 2.5

#გამრავლება
print(2 ** 3)  # 8
print(10 ** 4)  # 10000
print(2.5 ** 2)  # 6.25
print((-2) ** 3)  # -8
print(3 ** 5)  # 243

#გაყოფა
print(10 % 3)  # 1
print(100 % 20)  # 0
print(15 % 4)  # 3
print(7 % 5)  # 2
print(14 % 6)  # 2
