// number - არის რიცხვი მთელი ან წილადი.
// string - ბრჭყალებში "" ჩაწერილი ნებისმიერი ტექსტი.
// boolean - true false.
// nan - შედეგად ვიღებთ როცა არალოგიკური მათემატიკურ ამოცანას ვწერთ.
// undefined - არაფერი / განუსაზღვრელი მნიშვნელობა.
// null - არაფერი / უცნობი მნიშვნელობა.
/* consol.log() - ამაში ვწერთ რამეს და მერე consol tabში გამოაქვს ის რასაც ვწერტ.
ეს პროგრამისტებისთვის ძალიან გამოსადეგარია რადგან წერაში ეხმარება*/  
// - კომენტარია

console.log(40 + 27)
console.log(70 - 3)
console.log(30 * 2)
console.log(100 / 2)

prompt('enter_your_fav_number' )