# 1)

# custom ფუნქცია გამოიყენება იმისთვის რომ ჩვენი კოდი გავამარტივოთ და შედარებით მარტივი გზაა და არ მოგვიწევს წვალება.

# როგორ იწყობა?
# 1)ვწერთ def-ს
# 2)ვწერთ ფუნქციის სახელს (რასაც გვინდა!)
# 3)ვწერთ ფრჩხილებს და თუ საჭიროა პარამეტრსაც ვუწერთ
# 4)ვწერთ აუცილებლად ორ წერტილს ":" ფრჩხილების შემდეგ
# 5)უნდა დავიცვათ ინდენტაცია აუცილებლად! და დავწეროთ პრინტ ფუნქცია
# 6)შემდეგ ვწერთ იმ სიტყვას რაც გვინდა რომ გამოიტანოს ტერმინალში
# 7)და ბოლო ხაზზე ვწერთ ფუნქციის სახელს რაც დავარქვით და ფრჩხილები

#მაგალითად:

def greet():
    print("გამარჯობა!")
greet()


# 2)

def add_numbers(a, b):
    return a + b
print(add_numbers(344, 565))


# 3)

def check(number):
    if number % 2 == 0:
        print("რიცხვი ლუწია")
    else:
        print("რიცხვი კენტია")
check(3)


# 4)

def square(number):
    return number ** 2
print(square(30))


# 5)

def upper(text):
    return text.upper()
print(upper("kakha"))


# 6)

def full_name(name, surname):
    print(f"მისი სახელია {name} და გვარია {surname}")
full_name("კახა", "კალანდაძე")